---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewBoundingBoxUV(System.Double,System.Double,System.Double,System.Double)
source: html/66946c56-f27d-0cd0-2223-188de71e8281.htm
---
# Autodesk.Revit.Creation.Application.NewBoundingBoxUV Method

Creates a two-dimensional rectangle with supplied values.

## Syntax (C#)
```csharp
public BoundingBoxUV NewBoundingBoxUV(
	double min_u,
	double min_v,
	double max_u,
	double max_v
)
```

## Parameters
- **min_u** (`System.Double`) - The first coordinate of min.
- **min_v** (`System.Double`) - The second coordinate of min.
- **max_u** (`System.Double`) - The first coordinate of max.
- **max_v** (`System.Double`) - The second coordinate of max.